# Essential Functionality

## Reindexing

In [31]:
import pandas as pd

In [32]:
obj = pd.Series([1.2,-2.4,3.4],index=['a','c','d'])
obj

a    1.2
c   -2.4
d    3.4
dtype: float64

In [33]:
obj.reindex(['a','b','c','d'])

a    1.2
b    NaN
c   -2.4
d    3.4
dtype: float64

In [34]:
obj1=obj.reindex(['a','b','c','d'])

In [35]:
obj1

a    1.2
b    NaN
c   -2.4
d    3.4
dtype: float64

In [36]:
obj2 = pd.Series(['blue','yellow','green'],index=[0,2,4])
obj2

0      blue
2    yellow
4     green
dtype: object

In [37]:
obj3=obj2.reindex(range(6))
obj3

0      blue
1       NaN
2    yellow
3       NaN
4     green
5       NaN
dtype: object

In [38]:
obj4=obj2.reindex(range(6),method='ffill')
obj4

0      blue
1      blue
2    yellow
3    yellow
4     green
5     green
dtype: object

In [41]:
import numpy as np
frame=pd.DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],columns=['ouarzzate','casa',"agadir"])
frame

   ouarzzate  casa  agadir
a          0     1       2
c          3     4       5
d          6     7       8

In [43]:
frame2=frame.reindex(['a','b','c','d'])
frame2

   ouarzzate  casa  agadir
a        0.0   1.0     2.0
b        NaN   NaN     NaN
c        3.0   4.0     5.0
d        6.0   7.0     8.0

In [45]:
states=['califorina','boston','agadir']
frame.reindex(columns=states)

   califorina  boston  agadir
a         NaN     NaN       2
c         NaN     NaN       5
d         NaN     NaN       8

In [46]:
frame.loc['a']

ouarzzate    0
casa         1
agadir       2
Name: a, dtype: int32

In [47]:
frame

   ouarzzate  casa  agadir
a          0     1       2
c          3     4       5
d          6     7       8